In [1]:
import pandas as pd

# Deleting Rows and Columns in Series

In [3]:
data = pd.Series([1,12,112,1113,4124],index = list('abcde'))
data

a       1
b      12
c     112
d    1113
e    4124
dtype: int64

In [4]:
data.drop('e')

a       1
b      12
c     112
d    1113
dtype: int64

In [5]:
data.drop(['c','d'])

a       1
b      12
e    4124
dtype: int64

# Deleting Rows and Columns in Dataframe

In [6]:
data_dict = {'names':['vikas','akash','kaash','raash'],
            'marks':[50,55,20,30],
            'salary':[100,200,150,105]}
data_dict

{'names': ['vikas', 'akash', 'kaash', 'raash'],
 'marks': [50, 55, 20, 30],
 'salary': [100, 200, 150, 105]}

In [7]:
data2 = pd.DataFrame(data_dict)
data2

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150
3  raash     30     105

In [9]:
data2.drop([0,3])

   names  marks  salary
1  akash     55     200
2  kaash     20     150

In [10]:
data2

   names  marks  salary
0  vikas     50     100
1  akash     55     200
2  kaash     20     150
3  raash     30     105

In [11]:
data2.drop(['marks','salary'],axis=1,inplace=True)

In [12]:
data2

   names
0  vikas
1  akash
2  kaash
3  raash